import express from "express";
import cors from "cors";

import helmet from "helmet";
import rateLimit from "express-rate-limit";

import devoteeRoutes from "./routes/userRoute.js";
import errorMiddleware from "./middleware/errorMiddleware.js";



const app = express();


/*
|--------------------------------------------------------------------------
| Basic configuration
|--------------------------------------------------------------------------
*/




/*
|--------------------------------------------------------------------------
| Security
|--------------------------------------------------------------------------
*/

app.use(helmet());


/*
|--------------------------------------------------------------------------
| CORS
|--------------------------------------------------------------------------
*/

app.use(
  cors({
    origin: process.env.CLIENT_URL,
    credentials: true,
  })
);


/*
|--------------------------------------------------------------------------
| Body parser
|--------------------------------------------------------------------------
*/

app.use(express.json({ limit: "5mb" }));

app.use(
  express.urlencoded({
    extended: true,
    limit: "5mb",
  })
);


/*
|--------------------------------------------------------------------------
| Rate limiter
|--------------------------------------------------------------------------
*/

const apiLimiter = rateLimit({
  windowMs: 15 * 60 * 1000,
  limit: 100,

  standardHeaders: "draft-8",
  legacyHeaders: false,

  message: {
    success: false,
    message: "অনেক বেশি request করা হয়েছে। কিছুক্ষণ পরে আবার চেষ্টা করুন।",
  },
});

app.use("/api", apiLimiter);


/*
|--------------------------------------------------------------------------
| Static files
|--------------------------------------------------------------------------
*/

app.use(
  "/uploads",
  express.static("uploads")
);


/*
|--------------------------------------------------------------------------
| Health check
|--------------------------------------------------------------------------
*/

app.get("/", (req, res) => {
  res.status(200).json({
    success: true,
    message: "KMRF backend server is running",
  });
});


/*
|--------------------------------------------------------------------------
| API routes
|--------------------------------------------------------------------------
*/

app.use(
  "/api/create-user",
  devoteeRoutes
);
app.use('/api/user', devoteeRoutes)

/*
|--------------------------------------------------------------------------
| 404
|--------------------------------------------------------------------------
*/

app.use((req, res) => {
  res.status(404).json({
    success: false,
    message: "API route not found",
  });
});


/*
|--------------------------------------------------------------------------
| Error handler
|--------------------------------------------------------------------------
*/

app.use(errorMiddleware);


/*
|--------------------------------------------------------------------------
| Start server
|--------------------------------------------------------------------------
*/
export default app;
